use med
select * from Пациенты where Возрост <30 ---- вывести значения возроста меньше 30
go
select * from Врачи where Должность  = 'Хирург'---- вывести из таблицы Врачи значения,которые равны Хирург
go
select * from Отделения where [Номер комнат] <=10 ---номера комнат  меньше 10
go


-------------------------------------------------------------------------------
select * from Врачи where Фамилия ='Жилинская' OR Фамилия= 'Нуриева' 
go
select * from Отделения where [Название отделения] ='Хирургия' AND [Номер комнат]=7
go
select * from Пациенты where NOT Пол='ж'
go
----------------------------------------------------------------------------------
select* from Пациенты where Пол ='ж' AND Возрост >=23 AND Город='Минск'
go

 ------------------------------------------------------------------------------
 select * from Врачи where [Стаж работы] IN (5,10,15)
 go
 select*from Пациенты where Возрост IN (14,20,55)
 go
 ------------------------------------------------------------------
 Select * from Пациенты where Возрост BETWEEN 10 AND 45
 go
 Select * from Пациенты where Возрост NOT BETWEEN 20 AND 45
 go
 ---------------------------------------------------------------- ПРОВЕРКА НА МНОЖЕСТВО



 -----------------------------------------------------------------------
 SELECT * FROM [История болезни] where Лечение Like '%Операция%'
 go
 select* from [История болезни] where Upper (Лечение) Like 'А%' 
 go
 --------------------------------------------
 select * from Врачи where [Стаж работы] IS NULL 
 go
